# StructuralSectionDimensions Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..StructuralSectionDimensions Property
GroupTypeId Class See Also
---
Structural Section Dimensions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionDimensions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionDimensions As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionDimensions {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace